<?php
//Различные сообщения
return [
    'user' => [
        'reset_password_for_admin' => [
            'success' => 'Пароль успешно изменён.',
            'error'   => 'Ошибка при смене пароля. Попробуйте позже.',
        ],
        'get_user_for_token' => [
            'success' => 'Пользователь по токену получен успешно.'
        ],
        'get_for_id' => [
            'success' => 'Пользователь получен успешно.',
        ],
        'update' => [
           'success' => 'Информация о пользователе успешно изменена.',
            'error'   => 'Ошибка при изменении информации о пользователе. Попробуйте позже.',
        ],
        'commision_get' => [
            'success' => 'Судьи были получены успешно.',
        ],
        'delete' => [
            'success' => 'Пользователь был успешно удалён.',
        ],
    ],
    'recovery_password' => [
        'recovery' => [
            'success' => 'Пароль был успешно изменён.',
        ],
        'send' => [
            'success' => 'Ссылка на восстановление пароля отправлена на вашу электронную почту.',
        ],
    ],
    'personal_info' => [
        'update' => [
           'success' => 'Информация о пользователе успешно изменена.',
        ],
        'create' => [
           'success' => 'Информация о пользователе создана успешно.',
        ],
    ],
    'auth' => [
        'register' => [
            'success' => 'Вы успешно зарегистрированы.',
            'error'   => 'Регистрация прошла неудачно.',
        ],
        'login' => [
            'success'           => 'Вы успешно авторизовались.',
            'error'             => 'Неудачная авторизации.',
            'errorSocialAuth'   => 'Удаленный сервер не отвечает. Попробуйте позже.',
            'not_found'         => 'Пользователь не найден.',
            'failed'            => 'При авторизации произошла критическая ошибка. Попробуйте позже.'
        ],
        'logout' => [
            'success' => 'Пользователь успешно вышел.',
            'error' => 'При выходе пользователя произошла критическия ошибка.'
        ],
    ],
    'race' => [
        'get' => [
           'success' => 'Гонки получены успешно.',
        ],
        'get_for_id' => [
           'success' => 'Гонка по идентификатору получена успешно.',
        ],
        'create' => [
            'success' => 'Гонка успешно создана.',
        ],
        'toggle_is_work' => [
            'success' => 'Состояние гонки успешно изменено на :state.',
        ],
        'delete' => [
            'success' => 'Гонка успешно удалена.',
        ],
    ],
    'cup' => [
        'get_for_race_id' => [
            'success' => 'Кубок по идентификатору гонки получен успешно.',
        ],
        'get_for_id' => [
            'success' => 'Кубок по идентификатору получен успешно.',
        ],
        'create' => [
            'success' => 'Кубок успешно создан',
        ],
        'update' => [
            'success' => 'Кубок успешно обновлён',
        ],
    ],
    'grade' =>[
        'create' => [
            'success' => 'Класс гонки успешно создан.',
        ],
        'get' => [
            'success' => 'Класс гонки получен успешно.',
        ],
        'get_for_id' => [
            'success' => 'Класс гонки по идентификатору получен успешно.',
        ],
        'update' => [
            'success' => 'Класс гонки успешно изменён.',
        ],
    ],
    'command' => [
        'create' => [
            'success' => 'Команда успешно создана.',
        ],
        'get' => [
            'success' => 'Команда успешно получена.'
        ],
        'get_for_id' => [
            'success' => 'Команда по идентификатору получена успешно.',
        ],
        'update' => [
            'success' => 'Команда успешно изменена.',
        ],
        'delete' => [
            'success' => 'Команда успешно удаленаю',
        ],
        'add_couch' => [
            'success' => 'Тренер успешно :is_attach.'
        ],
    ],
    'track' => [
        'create' => [
           'success' => 'Трек успешно создан.',
            'error'   => 'Ошибка при создании трека.',
        ],
        'get' => [
           'success' => 'Треки получены успешно.',
        ],
        'get_for_id' => [
            'success' => 'Трек по идентификатору получен успешно.',
        ],
        'update' => [
            'success' => 'Трек успешно изменён.'
        ],
        'delete' => [
            'success' => 'Трек успешно удалён.',
        ],
    ],
    'attendance' => [
        'create' => [
            'success' => 'Платная услуга успешно создана.',
        ],
        'get_for_id' => [
            'success' => 'Платная услуга по идентификатору получена успешна.',
        ],
        'update' => [
            'success' => 'Платная услуга успешно изменена.',
        ],
        'delete' => [
            'success' => 'Платная услуга успешно удалена.',
        ],
    ],
    'transaction' => [
        'create' => [
            'success' => 'Транзакция успешно создана.',
        ],
        'success' => [
            'success' => 'Транзакция завершилась.',
        ],
        'failed' => [
            'failed' => 'Транзакция не завершилась.'
        ],
    ],
    'role' => [
        'get_change_role' => [
            'success' => 'Роль к которым может перейти пользователь успешно получены.',
        ],
        'change_role_for_default_user' => [
            'no_role' => 'У вас нет разрешения к этой роли.',
            'success' => 'Роль пользователя успешно изменена.',
        ],
    ],
    'document' => [
        'get_for_user_by_id' => [
            'success' => 'Документ по идентификатору получен успешно.',
            'not_found' => 'Документ не найден.',
        ],
        'get_for_user' => [
            'success' => 'Документы пользователя получены успешно.',
        ],
        'create' => [
            'success' => 'Документ успешно создан.',
        ],
        'update' => [
            'success' => 'Документ успешно изменён.',
        ],
        'delete' => [
            'success' => 'Документ успешно удалён.',
        ]
    ],
    'appointment_race' => [
        'get_users' => [
            'success' => 'Пользователи получены успешно.',
        ],
        'create' => [
            'success' => 'Запись на гонку успешно создана.',
        ],
        'delete' => [
            'success' => 'Запись на гонку успешно удалена.',
        ]
    ],
    'verification_email' => [
        'send' => [
            'success' => 'Код для подтверждения электронной почты отправлена на вашу почту.',
            'already_sent' => 'Почта уже подтверждена.',
        ],
        'verification' => [
            'success' => 'Ваша почта успешно подтверждена.',
            'no_code' => 'Код для подтверждения почты не был отправлен на почту.',
            'incorrect' => 'Код не подходит.'
        ],
    ],
    'error' => [
        'not_found' => 'Запрашиваемый ресурс не найден.',
        'not_allowed' => 'Доступ запрещен.',
        'not_auth_user' => 'Пользователь не авторизован.',
        'not_verification_email' => 'Почта пользователя не подтверждена.',
        'not_verification_phone' => 'Телефон пользователя не подтверждён.',
        'timeout_warning' => 'До следующе попытки осталось :time.',
    ],
    'status' => [
        'get_all' => [
            'success' => 'Статусы получены успешно.',
        ]
    ],
];
