<?php
//Различные сообщения
return [
    'user' => [
        'reset_password_for_admin' => [
            'success' => 'Пароль успешно изменён.',
            'error'   => 'Ошибка при смене пароля. Попробуйте позже.',
        ],
        'get_user_for_token' => [
            'success' => 'Пользователь по токену получен успешно'
        ],
    ],
    'personal_info' => [
        'update' => [
           'success' => 'Информация о пользователе успешно изменена.',
        ],
        'create' => [
           'success' => 'Информация о пользователе создана успешно.',
        ],
    ],
    'auth' => [
        'register' => [
            'success' => 'Вы успешно зарегистрированы',
            'error'   => 'Регистрация прошла неудачно',
        ],
        'login' => [
            'success'           => 'Вы успешно авторизовались',
            'error'             => 'Неудачная авторизации',
            'errorSocialAuth'   => 'Удаленный сервер не отвечает. Попробуйте позже',
            'not_found'         => 'Пользователь не найден',
            'failed'            => 'При авторизации произошла критическая ошибка. Попробуйте позже'
        ],
        'logout' => [
            'success' => 'Пользователь успешно вышел.',
            'error' => 'При выходе пользователя произошла критическия ошибка.'
        ],
    ],
    'race' => [
        'get' => [
           'success' => 'Гонки получены успешно.',
        ],
        'get_for_id' => [
           'success' => 'Гонка по идентификатору получена успешно.',
        ],
        'create' => [
            'success' => 'Гонка успешно создана.',
        ],
    ],
    'track' => [
        'create' => [
           'success' => 'Трек успешно создан.',
            'error'   => 'Ошибка при создании трека.',
        ],
        'get' => [
           'success' => 'Треки получены успешно.',
        ],
        'get_for_id' => [
            'success' => 'Трек по идентификатору получен успешно.',
        ],
    ],
    'role' => [
        'get_change_role' => [
            'success' => 'Роль к которым может перейти пользователь успешно получены.',
        ],
        'change_role_for_default_user' => [
            'no_role' => 'У вас нет разрешения к этой роли.',
            'success' => 'Роль пользователя успешно изменена.',
        ],
    ],
    'document' => [
        'get_for_user_by_id' => [
           'success' => 'Документ по идентификатору получен успешно.',
            'not_found' => 'Документ не найден.',
        ],
        'get_for_user' => [
            'success' => 'Документы пользователя получены успешно.',
        ],
        'create' => [
            'success' => 'Документ успешно создан.',
        ],
        'delete' => [
            'success' => 'Документ успешно удалён.',
        ]
    ],
    'appointment_race' => [
        'get_users' => [
            'success' => 'Пользователи получены успешно.',
        ],
        'create' => [
            'success' => 'Запись на гонку успешно создана.',
        ],
        'delete' => [
            'success' => 'Запись на гонку успешно удалена.',
        ]
    ],
    'error' => [
        'not_found' => 'Запрашиваемый ресурс не найден.',
        'not_allowed' => 'Доступ запрещен.',
    ],
];
