<?php
//Различные сообщения
return [
    'user' => [
        'reset_password_for_admin' => [
            'success' => 'Пароль успешно изменён.',
            'error'   => 'Ошибка при смене пароля. Попробуйте позже.',
        ]
    ],
    'register' => [
        'success' => 'Вы успешно зарегистрированы',
        'error'   => 'Регистрация прошла неудачно',
    ],
    'login' => [
        'success'           => 'Вы успешно авторизовались',
        'error'             => 'Неудачная авторизации',
        'errorSocialAuth'   => 'Удаленный сервер не отвечает. Попробуйте позже',
        'not_found'         => 'Пользователь не найден',
        'failed'            => 'При авторизации произошла критическая ошибка. Попробуйте позже'
    ],
    'logout' => [
        'success' => 'Пользователь успешно вышел',
        'error' => 'При выходе пользователя произошла критическия ошибка'
    ],
    'race',
    'track',
    'role',

];
